#+TITLE: My Emacs Config
Place your private configuration here! Remember, you do not need to run 'doom
sync' after modifying this file!

Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Georg R. Pollak" user-mail-address "pollakgeorg@gmail.com")
#+END_SRC

#+RESULTS:
: pollakgeorg@gmail.com

Starts the Emacs server
;; (server-start)

Here are some additional functions/macros that could help you configure Doom:

- `load!' for loading external *.el files relative to this one
- `use-package!' for configuring packages
- `after!' for running code after a package has loaded
- `add-load-path!' for adding directories to the `load-path', relative to
  this file. Emacs searches the `load-path' when you load packages with
  `require' or `use-package'.
- `map!' for binding new keys

To get information about any of these functions/macros, move the cursor over
the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
This will open documentation for it, including demos of how they are used.

You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
they are implemented.
** Startup buffer
#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice "~/org/todo.org")
#+END_SRC

#+RESULTS:
: ~/org/uni.org

** Set indent width
#+begin_src emacs-lisp
(setq-default tab-width 4)
#+end_src

#+RESULTS:
: 4

* Emacs Encrypted Secrets - Auth Sources
#+begin_src emacs-lisp
(setq auth-sources '("~/.authinfo.gpg" "~/.authinfo"))
#+end_src

#+RESULTS:
| ~/.authinfo.gpg | ~/.authinfo |

* Font
 Doom exposes five (optional) variables for controlling fonts in Doom. Here
 are the three important ones:

 + `doom-font'
 + `doom-variable-pitch-font'
 + `doom-big-font' -- used for `doom-big-font-mode'; use this for presentations or streaming.
    They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
    font string. You generally only need these two:
   #+BEGIN_SRC emacs-lisp
    ;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
    ;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))
   #+END_SRC

   #+RESULTS:
   : #<font-spec nil nil sans nil nil nil nil nil 13 nil nil nil nil>

** LSP-mode with clangd
#+BEGIN_SRC elisp
(setq lsp-clients-clangd-args '("-j=3"
                                "--background-index"
                                "--clang-tidy"
                                "--completion-style=detailed"
                                "--header-insertion=iwyu"))
(after! lsp-clangd (set-lsp-priority! 'clangd 2))
(use-package lsp-mode
  :hook ((prog-mode . lsp-deferred))
  :commands (lsp lsp-deferred)
  :config
  (progn
    (lsp-register-client
     (make-lsp-client :new-connection (lsp-tramp-connection "clangd")
                      :major-modes '(c-mode c++-mode)
                      :remote? t
                      :server-id 'clangd-remote))))
(add-to-list 'auto-mode-alist '("\\.hpp.base\\'" . cpp-mode))
(add-to-list 'auto-mode-alist '("\\.cpp.base\\'" . cpp-mode))
(add-hook 'emacs-lisp-mode #'lsp)
#+END_SRC

#+RESULTS:
| lsp-deferred | lsp | hl-todo-mode | display-line-numbers-mode | highlight-numbers-mode | vi-tilde-fringe-mode |

This will both set your clangd flags and choose clangd as the default server (if
it is the last =set-eglot-client! 'cc-mode= in your config).
* Leetcode
#+BEGIN_SRC elisp
;; (setq leetcode-save-solutions t)
;; (setq leetcode-directory "~/leetcode")
(use-package leetcode
    :config
    (setq leetcode-path "~/leetcode/"
          leetcode-language "c++")
)
#+END_SRC

#+RESULTS:
: ~/leetcode

* Org
If you use `org' and don't want your org files in the default location below,
change `org-directory'. It must be set before org loads!
#+BEGIN_SRC emacs-lisp
(setq org-hide-emphasis-markers t)
(setq org-directory "~/org/")
(setq org-agenda-files (list "~/org" "~/.doom.d/"))
(after! org
  (add-to-list 'org-todo-keywords '(sequence "TODAY(f)" "INPROGRESS(P)" "|"))
  (add-to-list 'org-todo-keyword-faces '("TODAY" . "green"))
  (add-to-list 'org-todo-keyword-faces '("ASK" . "green"))
  (add-to-list 'org-todo-keyword-faces '("INPROGRESS" . "orange")))


#+END_SRC

#+RESULTS:
: ((INPROGRESS . orange) ([-] . +org-todo-active) (STRT . +org-todo-active) ([?] . +org-todo-onhold) (WAIT . +org-todo-onhold) (HOLD . +org-todo-onhold) (PROJ . +org-todo-project) (NO . +org-todo-cancel) (KILL . +org-todo-cancel))

** Basic Configurations
#+BEGIN_SRC emacs-lisp
(setq +latex-viewers '(evince))
#+END_SRC

#+RESULTS:
| evince |

** Py Isort
#+begin_src elisp
(add-hook 'before-save-hook 'py-isort-before-save)
#+end_src

#+RESULTS:
| py-isort-before-save |
* hl-todo
Add Colored Keywords to your code.
#+BEGIN_SRC emacs-lisp
;; (after! hl-todo
;;     (setq hl-todo-keyword-faces
;;         '(("IMPORTANT" . "#967E1E")
;;           ("DONE" . "#afd8af")
;;           )))
(use-package hl-todo
:hook (prog-mode . hl-todo-mode)
:config
(setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        '(("TODO"       warning bold)
        ("FIXME"      error bold)
        ("HACK"       font-lock-constant-face bold)
        ("REVIEW"     font-lock-keyword-face bold)
        ("DONE"       font-lock-keyword-face bold)
        ("IMPORTANT"  font-lock-keyword-face bold)
        ("NOTE"       success bold)
        ("DEPRECATED" font-lock-doc-face bold))))
#+END_SRC


#+RESULTS:
| lsp-deferred | hl-todo-mode | display-line-numbers-mode | highlight-numbers-mode | vi-tilde-fringe-mode | editorconfig-major-mode-hook |

